Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

Create 3 differents Series, each of length 100, as follows:
The first a random number from 1 to 4
The second a random number from 1 to 3
The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   0  1      2
0  3  3  20903
1  4  1  24938
2  3  1  13051
3  4  3  14425
4  4  2  23535

Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [13]:
df = df.rename(columns = {'0': 'bedrs', '1': 'bathrs', '2': 'price_sqr_meter'})
df.head()

AttributeError: 'NoneType' object has no attribute 'rename'

Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [16]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)
#print(type(bigcolumn))
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       4
2       3
3       4
4       4
..    ...
95  16241
96  29926
97  10842
98  29861
99  25954

[300 rows x 1 columns]

Oops, it seems it is going only until index 99. Is it true?

In [17]:
len(bigcolumn)

300

Reindex the DataFrame so it goes from 0 to 299

In [19]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        4
2        3
3        4
4        4
..     ...
295  16241
296  29926
297  10842
298  29861
299  25954

[300 rows x 1 columns]